# Brewfile
# Install with:
#   brew bundle --file Brewfile

# --- Core CLI/dev tools ---
brew "git"
brew "neovim"
brew "node"
brew "pnpm"
brew "nx"
brew "pyenv"
brew "rbenv"

# Useful build/developer basics
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "wget"
brew "curl"
brew "tree"
brew "gh"
brew "sqlite"
brew "postgresql@16"
brew "redis"
brew "go"
brew "ruby-build"
brew "tree-sitter-cli"
cask "font-jetbrains-mono-nerd-font"

# Optional but very useful with Neovim / terminal workflows
brew "lazygit"
brew "bat"
brew "zoxide"

# LLMs & Agentic coding
cask "chatgpt"
cask "codex"
cask "codex-app"
cask "claude-code"

# --- Terminal / editor / containers ---
cask "iterm2"
cask "docker-desktop"

# --- Browser / general computer usage ---
cask "firefox"

# --- Productivity / utilities ---
cask "rectangle"
cask "appcleaner"
